tap "mongodb/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Tool that bootstraps your dotfiles
brew "dotbot"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple Node.js versions
brew "nvm"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Audio utility
cask "background-music"
# Clipboard manager
cask "maccy"
# .NET IDE
cask "rider"
mas "1Password for Safari", id: 1569813296
mas "Accelerate", id: 1459809092
mas "AdBlock", id: 1402042596
mas "CollageFactory Free", id: 620343399
mas "Diffraction", id: 1544476110
mas "Eradicator", id: 1671150519
mas "Fotor Photo Editor", id: 503039729
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Noir", id: 1592917505
mas "PubPeer", id: 1489865828
mas "Reolink Client", id: 1086871235
mas "Shazam", id: 897118787
mas "Speechify", id: 1624912180
mas "Super Agent", id: 1568262835
mas "Telegram", id: 747648890
mas "Vimari", id: 1480933944
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vsliveshare.vsliveshare"
vscode "ritwickdey.liveserver"
