tap "mongodb/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Tool that bootstraps your dotfiles
brew "dotbot"
# Distributed revision control system
brew "git"
# Manage multiple Node.js versions
brew "nvm"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Audio utility
cask "background-music"
# Clipboard manager
cask "maccy"
# .NET IDE
cask "rider"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vsliveshare.vsliveshare"
vscode "ritwickdey.liveserver"
